
## Plan Result (aat)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_container.service_containers[11]
  * azurerm_storage_container.service_containers_stg[11]
  * azurerm_storage_container.service_rejected_containers[11]
  * azurerm_storage_container.service_rejected_containers_stg[11]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
* Move
  * module.application_insights.azurerm_monitor_activity_log_alert.main => module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/app-insights-connection-string/ce8faefba18f4fe6aa361516fd8a77cf"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_container.service_containers[11] will be created
  + resource "azurerm_storage_container" "service_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "bulkscanaat"
    }

  # azurerm_storage_container.service_containers_stg[11] will be created
  + resource "azurerm_storage_container" "service_containers_stg" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "bulkscanaatstaging"
    }

  # azurerm_storage_container.service_rejected_containers[11] will be created
  + resource "azurerm_storage_container" "service_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "bulkscanaat"
    }

  # azurerm_storage_container.service_rejected_containers_stg[11] will be created
  + resource "azurerm_storage_container" "service_rejected_containers_stg" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-ibca-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "bulkscanaatstaging"
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Resources/deployments/BSP_alert"
        name                = "BSP_alert"
      ~ output_content      = jsonencode({}) -> (known after apply)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              + outputs        = {
                  + actionGroupId = {
                      + type  = "string"
                      + value = "[resourceId('microsoft.insights/actionGroups', parameters('actionGroupName'))]"
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main has moved to module.application_insights.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - bulk-scan-aat"
        name                = "Application Insights daily cap reached - bulk-scan-aat"
        tags                = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Insights/components/bulk-scan-aat"
        name                                  = "bulk-scan-aat"
        tags                                  = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":297,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->